zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
/*
 * Copyright (c) 2025 EXALT Technologies.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 *
 * MSPI flash controller driver for stm32 series with QSPI peripheral
 * This driver is based on the stm32Cube HAL QSPI driver
 *
 */

#define DT_DRV_COMPAT st_stm32_qspi_controller

#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/mspi.h>
#include <zephyr/irq.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/logging/log.h>
#include <stm32_ll_dma.h>
#include <stm32_bitops.h>
#include "mspi_stm32.h"

LOG_MODULE_REGISTER(mspi_stm32_qspi, CONFIG_MSPI_LOG_LEVEL);

/**
 * @brief Gives a QSPI_CommandTypeDef with all parameters set except Instruction, Address, NbData
 */
static QSPI_CommandTypeDef mspi_stm32_qspi_prepare_cmd(enum mspi_io_mode cfg_mode,
						       enum mspi_data_rate cfg_rate)
{
	/* Command empty structure */
	QSPI_CommandTypeDef cmd_tmp = {0};

	/* QSPI specific configuration */
	cmd_tmp.AddressSize = QSPI_ADDRESS_24_BITS;
	cmd_tmp.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
	cmd_tmp.DdrMode =
		cfg_rate == MSPI_DATA_RATE_DUAL ? QSPI_DDR_MODE_ENABLE : QSPI_DDR_MODE_DISABLE;
	cmd_tmp.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
	cmd_tmp.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

	/* Configure based on IO mode */
	switch (cfg_mode) {
	case MSPI_IO_MODE_QUAD:
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_4_LINES;
		cmd_tmp.AddressMode = QSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = QSPI_DATA_4_LINES;
		break;
	case MSPI_IO_MODE_QUAD_1_4_4:
		/* Command uses 1 line, address and data use 4 lines */
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = QSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = QSPI_DATA_4_LINES;
		break;
	case MSPI_IO_MODE_QUAD_1_1_4:
		/* Command and address use 1 line, data uses 4 lines */
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = QSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = QSPI_DATA_4_LINES;
		break;
	case MSPI_IO_MODE_DUAL:
		/* All phases use 2 lines */
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_2_LINES;
		cmd_tmp.AddressMode = QSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = QSPI_DATA_2_LINES;
		break;
	case MSPI_IO_MODE_DUAL_1_2_2:
		/* Command uses 1 line, address and data use 2 lines */
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = QSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = QSPI_DATA_2_LINES;
		break;
	case MSPI_IO_MODE_DUAL_1_1_2:
		/* Command and address use 1 line, data uses 2 lines */
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = QSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = QSPI_DATA_2_LINES;
		break;
	case MSPI_IO_MODE_OCTAL:
		/* QSPI doesn't support octal mode, fall through to single */
		LOG_WRN("QSPI doesn't support octal mode, using single line");
		__fallthrough;
	case MSPI_IO_MODE_SINGLE:
	default:
		/* All phases use 1 line */
		cmd_tmp.InstructionMode = QSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = QSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = QSPI_DATA_1_LINE;
		break;
	}

	return cmd_tmp;
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI emulation controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static bool mspi_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return k_sem_count_get(&dev_data->ctx.lock) == 0;
}

static uint32_t mspi_stm32_qspi_hal_address_size(uint8_t address_length)
{
	if (address_length == 4U) {
		return QSPI_ADDRESS_32_BITS;
	}

	return QSPI_ADDRESS_24_BITS;
}

/*
 * DMA Support
 */
#if defined(CONFIG_MSPI_DMA)
/**
 * @brief Initialize DMA for QSPI
 *
 * Configures both Zephyr DMA driver and HAL DMA driver for QSPI transfers.
 * Due to use of QSPI HAL API, both drivers need to be configured.
 *
 * @param hdma Pointer to HAL DMA handle
 * @param dma_stream Pointer to Zephyr DMA stream structure
 * @return 0 on success, negative errno on failure
 */
static int mspi_stm32_qspi_dma_init(DMA_HandleTypeDef *hdma, struct stm32_stream *dma_stream)
{
	int ret;

	/* Check if DMA device is ready */
	if (!device_is_ready(dma_stream->dev)) {
		LOG_ERR("DMA %s device not ready", dma_stream->dev->name);
		return -ENODEV;
	}

	/* Configure Zephyr DMA driver */
	dma_stream->cfg.user_data = hdma;
	dma_stream->cfg.channel_direction = PERIPHERAL_TO_MEMORY;
	/* This field is used to inform driver that it is overridden */
	dma_stream->cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;

	ret = dma_config(dma_stream->dev, dma_stream->channel, &dma_stream->cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d", dma_stream->channel);
		return ret;
	}

	ret = dma_stm32_zcfg_to_halcfg(dma_stream->dev, &dma_stream->cfg, &hdma->Init,
				       DMA_ADDR_ADJ_NO_CHANGE, DMA_ADDR_ADJ_INCREMENT);
	if (ret < 0) {
		return ret;
	}

	/* Get DMA channel instance */
	hdma->Instance = STM32_DMA_GET_CHANNEL_INSTANCE(dma_stream->reg, dma_stream->channel);

	/* Initialize HAL DMA */
	if (HAL_DMA_Init(hdma) != HAL_OK) {
		LOG_ERR("QSPI DMA Init failed");
		return -EIO;
	}

	LOG_DBG("QSPI DMA initialized");
	return 0;
}

/**
 * @brief Setup DMA for QSPI controller
 *
 * @param dev_cfg Device configuration
 * @param dev_data Device data
 * @return 0 on success, negative errno on failure
 */
static int mspi_stm32_qspi_dma_setup(const struct mspi_stm32_conf *dev_cfg,
				     struct mspi_stm32_data *dev_data)
{
	int ret;

	if (!dev_cfg->dma_specified) {
		LOG_ERR("DMA configuration is missing from the device tree");
		return -EIO;
	}

	/* Initialize DMA */
	ret = mspi_stm32_qspi_dma_init(&dev_data->hdma, &dev_data->dma);
	if (ret != 0) {
		LOG_ERR("QSPI DMA init failed");
		return ret;
	}

	/* Link DMA to QSPI HAL handle */
	__HAL_LINKDMA(&dev_data->hmspi.qspi, hdma, dev_data->hdma);

