zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
	LOG_DBG("QSPI with DMA Transfer configured");
	return 0;
}

/**
 * @brief DMA callback for QSPI transfers
 *
 * Routes DMA interrupts to HAL DMA IRQ handler
 */
static void mspi_stm32_qspi_dma_callback(const struct device *dev, void *arg,
					 uint32_t channel, int status)
{
	DMA_HandleTypeDef *hdma = arg;

	ARG_UNUSED(dev);
	ARG_UNUSED(channel);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d", channel);
	}

	HAL_DMA_IRQHandler(hdma);
}
#endif /* CONFIG_MSPI_DMA */

/* Check if device is in memory-mapped mode */
static bool mspi_stm32_qspi_is_memmap(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	/* Check the FMODE bits in CCR register to see if in memory-mapped mode */
	return stm32_reg_read_bits(&dev_data->hmspi.qspi.Instance->CCR, QUADSPI_CCR_FMODE) ==
	       QUADSPI_CCR_FMODE;
}

/* Set the device back in command mode */
static int mspi_stm32_qspi_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (!mspi_stm32_qspi_is_memmap(controller)) {
		/* Already in command mode */
		return 0;
	}

	if (HAL_QSPI_Abort(&dev_data->hmspi.qspi) != HAL_OK) {
		LOG_ERR("QSPI MemMapped abort failed");
		return -EIO;
	}

	LOG_DBG("QSPI memory mapped mode disabled");
	return 0;
}

/* Set the device in MemMapped mode */
static int mspi_stm32_qspi_memmap_on(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	QSPI_CommandTypeDef s_command;
	QSPI_MemoryMappedTypeDef s_MemMappedCfg;
	HAL_StatusTypeDef hal_ret;

	if (mspi_stm32_qspi_is_memmap(controller)) {
		/* Already in memory-mapped mode */
		return 0;
	}

	s_command = mspi_stm32_qspi_prepare_cmd(dev_data->dev_cfg.io_mode,
						dev_data->dev_cfg.data_rate);

	/* Set read command - use the configured read command if available */
	if (dev_data->dev_cfg.read_cmd != 0) {
		s_command.Instruction = dev_data->dev_cfg.read_cmd;
	} else {
		/* Fallback to standard fast read commands */
		if (dev_data->dev_cfg.addr_length == 4) {
			s_command.Instruction = MSPI_NOR_CMD_READ_FAST_4B;
		} else {
			s_command.Instruction = MSPI_NOR_CMD_READ_FAST;
		}
	}

	s_command.AddressSize = mspi_stm32_qspi_hal_address_size(dev_data->dev_cfg.addr_length);
	s_command.DummyCycles = dev_data->dev_cfg.rx_dummy;
	s_command.Address = 0;

	/* Enable the memory-mapping */
	s_MemMappedCfg.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;
	s_MemMappedCfg.TimeOutPeriod = 0;

	hal_ret = HAL_QSPI_MemoryMapped(&dev_data->hmspi.qspi, &s_command, &s_MemMappedCfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to enable QSPI memory mapped mode: %d", hal_ret);
		return -EIO;
	}

	LOG_DBG("QSPI memory mapped mode enabled");
	return 0;
}

/**
 * @brief Check if command requires indirect mode in XIP configuration
 *
 * @param packet Pointer to transfer packet
 * @return true if command needs indirect mode.
 * @return false if command can use memory-mapped mode.
 */
static bool mspi_stm32_qspi_needs_indirect_mode(const struct mspi_xfer_packet *packet)
{
	return (packet->cmd == MSPI_NOR_CMD_WREN) || (packet->cmd == MSPI_NOR_CMD_SE) ||
	       (packet->cmd == MSPI_NOR_CMD_SE_4B) || (packet->cmd == MSPI_NOR_CMD_RDSR) ||
	       (packet->dir == MSPI_TX);
}

/**
 * @brief Execute data transfer (TX or RX) in indirect mode
 *
 * @param dev Pointer to device structure
 * @param packet Pointer to transfer packet
 * @param access_mode Access mode (SYNC, ASYNC, or DMA)
 * @return 0 on success
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_qspi_execute_transfer(const struct device *dev,
					    const struct mspi_xfer_packet *packet,
					    uint8_t access_mode)
{
	HAL_StatusTypeDef hal_ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_QSPI_Receive(&dev_data->hmspi.qspi, packet->data_buf,
						   HAL_QSPI_TIMEOUT_DEFAULT_VALUE);
			break;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_QSPI_Receive_IT(&dev_data->hmspi.qspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
#if defined(CONFIG_MSPI_DMA)
			hal_ret = HAL_QSPI_Receive_DMA(&dev_data->hmspi.qspi, packet->data_buf);
#else
			LOG_ERR("DMA mode not enabled (CONFIG_MSPI_DMA not set)");
			return -ENOTSUP;
#endif
			break;
		default:
			LOG_ERR("Invalid access mode: %d", access_mode);
			return -EINVAL;
		}
	} else {
		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_QSPI_Transmit(&dev_data->hmspi.qspi, packet->data_buf,
						    HAL_QSPI_TIMEOUT_DEFAULT_VALUE);
			break;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_QSPI_Transmit_IT(&dev_data->hmspi.qspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
#if defined(CONFIG_MSPI_DMA)
			hal_ret = HAL_QSPI_Transmit_DMA(&dev_data->hmspi.qspi, packet->data_buf);
#else
			LOG_ERR("DMA mode not enabled (CONFIG_MSPI_DMA not set)");
			return -ENOTSUP;
#endif
			break;
		default:
			LOG_ERR("Invalid access mode: %d", access_mode);
			return -EINVAL;
		}
	}

	if ((hal_ret != HAL_OK) || (access_mode == MSPI_ACCESS_SYNC)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);

		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to start %s transfer: %d",
				packet->dir == MSPI_RX ? "receive" : "transmit", hal_ret);
			return -EIO;
		}

		return 0;
	}

	/* For ASYNC mode, wait for IRQ completion (PM locks released in ISR) */
	if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
		LOG_ERR("Failed to complete async transfer");
		/* If semaphore wait fails, ISR never completed, so release PM locks */
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return -EIO;
	}

	return 0;
}

/**
 * @brief Read data in memory-mapped mode (XIP)
 *
 * Note: Write operations are NOT supported in memory-mapped mode for QSPI.
 * Writes must use indirect mode .
 *
 * @param dev Pointer to the device structure
 * @param packet Pointer to transfer packet (must be RX direction)
 * @return 0 on success.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_qspi_memory_mapped_read(const struct device *dev,
					      const struct mspi_xfer_packet *packet)
{
	struct mspi_stm32_data *dev_data = dev->data;
	int ret;

	if (!mspi_stm32_qspi_is_memmap(dev)) {
		ret = mspi_stm32_qspi_memmap_on(dev);
		if (ret != 0) {
			LOG_ERR("Failed to enable memory mapped mode");
			return ret;
		}
	}

	uintptr_t mmap_addr = dev_data->memmap_base_addr + packet->address;

