zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
	/* Memory-mapped mode is READ-ONLY for QSPI */
	LOG_DBG("Memory-mapped read from 0x%08lx, len %zu", mmap_addr, packet->num_bytes);
	memcpy(packet->data_buf, (void *)mmap_addr, packet->num_bytes);

	return 0;
}

/**
 * @brief Send a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode.
 *
 * @param dev Pointer to device structure
 * @param packet Pointer to transfer packet
 * @param access_mode Access mode (SYNC or ASYNC)
 * @return 0 on success.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_qspi_access(const struct device *dev, const struct mspi_xfer_packet *packet,
				  uint8_t access_mode)
{
	struct mspi_stm32_data *dev_data = dev->data;
	HAL_StatusTypeDef hal_ret;
	int ret;

	/* === XIP Mode: Handle memory-mapped or indirect mode switching === */
	if (dev_data->memmap_cfg.enable) {
		/* Read operations can use memory-mapped mode */
		if (!mspi_stm32_qspi_needs_indirect_mode(packet)) {
			return mspi_stm32_qspi_memory_mapped_read(dev, packet);
		}

		/* Commands that need indirect mode*/
		ret = mspi_stm32_qspi_memmap_off(dev);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped mode");
			return ret;
		}
	}

	/* === Indirect Mode: Standard command + data transfer === */

	/* Acquire PM locks for indirect mode operations */
	(void)pm_device_runtime_get(dev);
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* Prepare QSPI command structure */
	QSPI_CommandTypeDef cmd = mspi_stm32_qspi_prepare_cmd(dev_data->dev_cfg.io_mode,
							      dev_data->dev_cfg.data_rate);

	cmd.NbData = packet->num_bytes;
	cmd.Instruction = packet->cmd;
	cmd.DummyCycles = packet->dir == MSPI_TX ? dev_data->ctx.xfer.tx_dummy
					  : dev_data->ctx.xfer.rx_dummy;
	cmd.Address = packet->address;
	cmd.AddressSize = mspi_stm32_qspi_hal_address_size(dev_data->ctx.xfer.addr_length);

	if (cmd.NbData == 0) {
		cmd.DataMode = QSPI_DATA_NONE;
	}

	if (dev_data->ctx.xfer.addr_length == 0) {
		/* Commands without an address phase, e.g. RDID or WREN */
		cmd.AddressMode = QSPI_ADDRESS_NONE;
	}

	hal_ret = HAL_QSPI_Command(&dev_data->hmspi.qspi, &cmd, HAL_QSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("HAL_QSPI_Command failed: %d", hal_ret);
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return -EIO;
	}

	/* If no data phase, we're done */
	if (packet->num_bytes == 0) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return 0;
	}

	/* Execute the data transfer (TX or RX) */
	return mspi_stm32_qspi_execute_transfer(dev, packet, access_mode);
}

/**
 * @brief Validate MSPI configuration parameters
 *
 * @param config Pointer to MSPI configuration
 * @return 0 on success, negative errno on failure
 */
static int mspi_stm32_qspi_conf_validate(const struct mspi_cfg *config, uint32_t max_frequency)
{
	/* Only Controller mode is supported */
	if (config->op_mode != MSPI_OP_MODE_CONTROLLER) {
		LOG_ERR("Only support MSPI controller mode.");
		return -ENOTSUP;
	}

	/* Check the max possible freq. */
	if (config->max_freq > max_frequency) {
		LOG_ERR("Max_freq %d too large.", config->max_freq);
		return -ENOTSUP;
	}

	if (config->duplex != MSPI_HALF_DUPLEX) {
		LOG_ERR("Only support half duplex mode.");
		return -ENOTSUP;
	}

	if (config->num_periph > MSPI_MAX_DEVICE) {
		LOG_ERR("Invalid MSPI peripheral number.");
		return -ENOTSUP;
	}

	return 0;
}

/**
 * @brief Configure QSPI clocks and calculate prescaler
 *
 * @param cfg Device configuration
 * @param data Device data
 * @return 0 on success, negative errno on failure
 */
static int mspi_stm32_qspi_clock_config(const struct mspi_stm32_conf *cfg,
					struct mspi_stm32_data *data)
{
	uint32_t ahb_clock_freq;
	uint32_t prescaler;

	/* Clock configuration */
	if (clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
			     (clock_control_subsys_t)&cfg->pclken[0]) != 0) {
		LOG_ERR("Could not enable MSPI clock");
		return -EIO;
	}
	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				   (clock_control_subsys_t)&cfg->pclken[0], &ahb_clock_freq) < 0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken)");
		return -EIO;
	}

	/* Calculate prescaler based on desired frequency */
	for (prescaler = MSPI_STM32_CLOCK_PRESCALER_MIN;
	     prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX; prescaler++) {
		data->dev_cfg.freq = MSPI_STM32_CLOCK_COMPUTE(ahb_clock_freq, prescaler);

		if (data->dev_cfg.freq <= cfg->mspicfg.max_freq) {
			break;
		}
	}

	__ASSERT_NO_MSG(prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX);

	/* Set prescaler in QSPI HAL handle */
	data->hmspi.qspi.Init.ClockPrescaler = prescaler;

	return 0;
}

/**
 * @brief Initialize QSPI HAL
 *
 * @param hmspi QSPI HAL handle
 * @return 0 on success, negative errno on failure
 */
static int mspi_stm32_qspi_hal_init(QSPI_HandleTypeDef *hmspi)
{
	HAL_StatusTypeDef hal_ret;

	/* Initialize remaining QSPI handle parameters */
	hmspi->Init.FifoThreshold = MSPI_STM32_FIFO_THRESHOLD;
	hmspi->Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_1_CYCLE;
	hmspi->Init.ClockMode = QSPI_CLOCK_MODE_0;
	hmspi->Init.FlashID = QSPI_FLASH_ID_1;
	hmspi->Init.DualFlash = QSPI_DUALFLASH_DISABLE;

	/* Initialize HAL QSPI */
	hal_ret = HAL_QSPI_Init(hmspi);
	if (hal_ret != HAL_OK) {
		LOG_ERR("HAL_QSPI_Init failed: %d", hal_ret);
		return -EIO;
	}

	return 0;
}

/**
 * API implementation of mspi_config : controller configuration.
 *
 * @param spec Pointer to MSPI device tree spec.
 * @return 0 if successful.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_qspi_config(const struct mspi_dt_spec *spec)
{
	const struct device *controller = spec->bus;
	const struct mspi_cfg *config = &spec->config;
	const struct mspi_stm32_conf *cfg = controller->config;
	struct mspi_stm32_data *data = controller->data;
	int ret;

	LOG_DBG("Configuring QSPI controller");

	ret = mspi_stm32_qspi_conf_validate(config, cfg->mspicfg.max_freq);
	if (ret != 0) {
		return ret;
	}

