zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
	(void)pm_device_runtime_get(controller);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* Configure pins */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("MSPI pinctrl setup failed");
		goto end;
	}

	if (data->dev_cfg.dqs_enable && !cfg->mspicfg.dqs_support) {
		LOG_ERR("MSPI dqs mismatch (not supported but enabled)");
		ret = -ENOTSUP;
		goto end;
	}

	/* Configure IRQ */
	cfg->irq_config();

	/* Configure clocks and calculate prescaler */
	ret = mspi_stm32_qspi_clock_config(cfg, data);
	if (ret != 0) {
		goto end;
	}

	/* Initialize HAL */
	ret = mspi_stm32_qspi_hal_init(&data->hmspi.qspi);
	if (ret != 0) {
		goto end;
	}

#if defined(CONFIG_MSPI_DMA)
	/* Setup DMA if specified in device tree */
	if (cfg->dma_specified) {
		ret = mspi_stm32_qspi_dma_setup(cfg, data);
		if (ret != 0) {
			LOG_ERR("QSPI DMA setup failed: %d", ret);
			goto end;
		}
	}
#endif

	/* Initialize semaphores */
	if (k_sem_count_get(&data->ctx.lock) == 0) {
		k_sem_give(&data->ctx.lock);
	}

	LOG_INF("QSPI controller configured successfully");

end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(controller);

	return ret;
}

/**
 * Validate and set frequency configuration.
 */
static int mspi_stm32_qspi_validate_and_set_freq(struct mspi_stm32_data *data, uint32_t freq,
						 uint32_t max_frequency)
{
	if (freq > max_frequency) {
		LOG_ERR("%u, freq is too large", __LINE__);
		return -ENOTSUP;
	}
	data->dev_cfg.freq = freq;
	return 0;
}

/**
 * Validate and set QSPI IO mode.
 * QSPI hardware doesn't support octal mode.
 */
static int mspi_stm32_qspi_validate_and_set_io_mode(struct mspi_stm32_data *data, uint32_t io_mode)
{
	if (io_mode == MSPI_IO_MODE_OCTAL) {
		LOG_ERR("%u, QSPI doesn't support octal mode", __LINE__);
		return -ENOTSUP;
	}

	if (io_mode >= MSPI_IO_MODE_MAX) {
		LOG_ERR("%u, Invalid io_mode", __LINE__);
		return -EINVAL;
	}

	data->dev_cfg.io_mode = io_mode;
	return 0;
}

/**
 * Validate and set QSPI data rate.
 * Only single data rate (SDR) is currently supported.
 */
static int mspi_stm32_qspi_validate_and_set_data_rate(struct mspi_stm32_data *data,
						      uint32_t data_rate)
{
	if (data_rate != MSPI_DATA_RATE_SINGLE) {
		LOG_ERR("%u, only single data rate supported", __LINE__);
		return -ENOTSUP;
	}

	if (data_rate >= MSPI_DATA_RATE_MAX) {
		LOG_ERR("%u, Invalid data_rate", __LINE__);
		return -EINVAL;
	}

	data->dev_cfg.data_rate = data_rate;
	return 0;
}

/**
 * Validate and set CPP (Clock Polarity/Phase).
 */
static int mspi_stm32_qspi_validate_and_set_cpp(struct mspi_stm32_data *data, uint32_t cpp)
{
	if (cpp > MSPI_CPP_MODE_3) {
		LOG_ERR("%u, Invalid cpp", __LINE__);
		return -EINVAL;
	}
	data->dev_cfg.cpp = cpp;
	return 0;
}

/**
 * Validate and set endianness.
 */
static int mspi_stm32_qspi_validate_and_set_endian(struct mspi_stm32_data *data, uint32_t endian)
{
	if (endian > MSPI_XFER_BIG_ENDIAN) {
		LOG_ERR("%u, Invalid endian", __LINE__);
		return -EINVAL;
	}
	data->dev_cfg.endian = endian;
	return 0;
}

/**
 * Validate and set chip select polarity.
 */
static int mspi_stm32_qspi_validate_and_set_ce_polarity(struct mspi_stm32_data *data,
							uint32_t ce_polarity)
{
	if (ce_polarity > MSPI_CE_ACTIVE_HIGH) {
		LOG_ERR("%u, Invalid ce_polarity", __LINE__);
		return -EINVAL;
	}
	data->dev_cfg.ce_polarity = ce_polarity;
	return 0;
}

/**
 * Validate and set DQS (Data Strobe) configuration.
 */
static int mspi_stm32_qspi_validate_and_set_dqs(struct mspi_stm32_data *data, bool dqs_enable,
						bool dqs_support)
{
	if (dqs_enable && !dqs_support) {
		LOG_ERR("%u, DQS mode not supported", __LINE__);
		return -ENOTSUP;
	}
	data->dev_cfg.dqs_enable = dqs_enable;
	return 0;
}

/**
 * @brief Set transfer-related configuration parameters
 *
 * @param data Pointer to device data
 * @param param_mask Configuration mask
 * @param dev_cfg Device configuration to apply
 */
static void mspi_stm32_qspi_set_transfer_params(struct mspi_stm32_data *data,
						const enum mspi_dev_cfg_mask param_mask,
						const struct mspi_dev_cfg *dev_cfg)
{
	if ((param_mask & MSPI_DEVICE_CONFIG_RX_DUMMY) != 0) {
		data->dev_cfg.rx_dummy = dev_cfg->rx_dummy;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_TX_DUMMY) != 0) {
		data->dev_cfg.tx_dummy = dev_cfg->tx_dummy;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_READ_CMD) != 0) {
		data->dev_cfg.read_cmd = dev_cfg->read_cmd;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_WRITE_CMD) != 0) {
		data->dev_cfg.write_cmd = dev_cfg->write_cmd;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_CMD_LEN) != 0) {
		data->dev_cfg.cmd_length = dev_cfg->cmd_length;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_ADDR_LEN) != 0) {
		data->dev_cfg.addr_length = dev_cfg->addr_length;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_MEM_BOUND) != 0) {
		data->dev_cfg.mem_boundary = dev_cfg->mem_boundary;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_BREAK_TIME) != 0) {
		data->dev_cfg.time_to_break = dev_cfg->time_to_break;
	}
}

/**
 * Check and save dev_cfg to controller data->dev_cfg.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param param_mask Macro definition of what to be configured in cfg.
 * @param dev_cfg The device runtime configuration for the MSPI controller.
 * @return 0 MSPI device configuration successful.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_qspi_dev_cfg_save(const struct device *controller,
					const enum mspi_dev_cfg_mask param_mask,
					const struct mspi_dev_cfg *dev_cfg)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	struct mspi_stm32_data *data = controller->data;
	int ret = 0;

	if ((param_mask & MSPI_DEVICE_CONFIG_CE_NUM) != 0) {
		data->dev_cfg.ce_num = dev_cfg->ce_num;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_FREQUENCY) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_freq(data, dev_cfg->freq,
							    cfg->mspicfg.max_freq);
		if (ret != 0) {
			return ret;
		}
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_IO_MODE) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_io_mode(data, dev_cfg->io_mode);
		if (ret != 0) {
			return ret;
		}
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_DATA_RATE) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_data_rate(data, dev_cfg->data_rate);
		if (ret != 0) {
			return ret;
		}
	}

