zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
	if ((param_mask & MSPI_DEVICE_CONFIG_CPP) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_cpp(data, dev_cfg->cpp);
		if (ret != 0) {
			return ret;
		}
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_ENDIAN) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_endian(data, dev_cfg->endian);
		if (ret != 0) {
			return ret;
		}
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_CE_POL) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_ce_polarity(data, dev_cfg->ce_polarity);
		if (ret != 0) {
			return ret;
		}
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_DQS) != 0) {
		ret = mspi_stm32_qspi_validate_and_set_dqs(data, dev_cfg->dqs_enable,
							   cfg->mspicfg.dqs_support);
		if (ret != 0) {
			return ret;
		}
	}

	/* Set transfer-related configuration parameters */
	mspi_stm32_qspi_set_transfer_params(data, param_mask, dev_cfg);

	return 0;
}

/**
 * API implementation of mspi_dev_config : controller device specific configuration
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param param_mask Macro definition of what to be configured in cfg.
 * @param dev_cfg The device runtime configuration for the MSPI controller.
 *
 * @retval 0 if successful.
 * @retval -EINVAL invalid capabilities, failed to configure device.
 * @retval -ENOTSUP capability not supported by MSPI peripheral.
 */
static int mspi_stm32_qspi_dev_config(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const enum mspi_dev_cfg_mask param_mask,
				      const struct mspi_dev_cfg *dev_cfg)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	struct mspi_stm32_data *data = controller->data;
	bool locked = false;
	int ret = 0;

	/* Check if device ID has changed and lock accordingly */
	if (data->dev_id != dev_id) {
		/* The controller lock is taken here and kept for the whole
		 * session, until the device releases it through
		 * mspi_get_channel_status().
		 */
		if (k_mutex_lock(&data->lock, K_MSEC(CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE))) {
			LOG_ERR("Failed to acquire lock for device config");
			return -EBUSY;
		}

		locked = true;
	}

	if (mspi_is_inp(controller)) {
		ret = -EBUSY;
		goto e_return;
	}

	data->dev_id = dev_id;

	if (param_mask == MSPI_DEVICE_CONFIG_NONE && !cfg->mspicfg.sw_multi_periph) {
		/* Nothing to do but saving the device ID */
		return 0;
	}

	/* Validate and save device configuration */
	ret = mspi_stm32_qspi_dev_cfg_save(controller, param_mask, dev_cfg);
	if (ret != 0) {
		LOG_ERR("failed to change device cfg");
		goto e_return;
	}

	return 0;

e_return:
	if (locked) {
		data->dev_id = NULL;
		k_mutex_unlock(&data->lock);
	}

	return ret;
}

/**
 * API implementation of mspi_memmap_config : XIP configuration
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param memmap_cfg The controller XIP configuration for MSPI.
 *
 * @retval 0 if successful.
 * @retval -ESTALE device ID don't match, need to call mspi_dev_config first.
 */
static int mspi_stm32_qspi_memmap_config(const struct device *controller,
					 const struct mspi_dev_id *dev_id,
					 const struct mspi_memmap_cfg *memmap_cfg)
{
	struct mspi_stm32_data *dev_data = controller->data;
	int ret = 0;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("memmap_config: dev_id don't match");
		return -ESTALE;
	}

	ret = pm_device_runtime_get(controller);
	if (ret != 0) {
		LOG_ERR_PM_DEVICE_RUNTIME_GET(controller, __LINE__);
		return ret;
	}

	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	if (!memmap_cfg->enable) {
		/* This is for aborting memory mapped mode */
		ret = mspi_stm32_qspi_memmap_off(controller);
	} else {
		ret = mspi_stm32_qspi_memmap_on(controller);
	}

	if (ret == 0) {
		dev_data->memmap_cfg = *memmap_cfg;
		LOG_INF("QSPI XIP configured %d", memmap_cfg->enable);
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	if (pm_device_runtime_put(controller)) {
		LOG_ERR_PM_DEVICE_RUNTIME_PUT(controller, __LINE__);
	}

	return ret;
}

/**
 * API implementation of mspi_get_channel_status.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param ch Not used.
 *
 * @retval 0 if successful.
 * @retval -EBUSY MSPI bus is busy
 */
static int mspi_stm32_qspi_get_channel_status(const struct device *controller, uint8_t ch)
{
	struct mspi_stm32_data *data = controller->data;
	QSPI_HandleTypeDef *hmspi = &data->hmspi.qspi;

	ARG_UNUSED(ch);

	if (mspi_is_inp(controller) || (hmspi->Instance->SR & QUADSPI_SR_BUSY) != 0) {
		return -EBUSY;
	}

	/* The controller is idle: end the session started by
	 * mspi_dev_config() and release the controller lock.
	 */
	data->dev_id = NULL;
	k_mutex_unlock(&data->lock);

	return 0;
}

/**
 * API implementation of mspi_transceive.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param xfer Pointer to the MSPI transfer started by dev_id.
 *
 * @retval 0 if successful.
 * @retval -ESTALE device ID don't match, need to call mspi_dev_config first.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_qspi_transceive(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const struct mspi_xfer *xfer)
{
	struct mspi_stm32_data *data = controller->data;
	struct mspi_stm32_context *ctx = &data->ctx;
	const struct mspi_xfer_packet *packet;
	uint32_t packet_idx;
	uint8_t access_mode;
	int ret = 0;

	/* Verify device ID matches */
	if (dev_id != data->dev_id) {
		LOG_ERR("transceive : dev_id don't match");
		return -ESTALE;
	}

	if (xfer->num_packet == 0 || xfer->packets == NULL ||
	    xfer->timeout > CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE) {
		LOG_ERR("Transfer: wrong parameters");
		return -EFAULT;
	}

	switch (xfer->xfer_mode) {
	case MSPI_PIO:
		access_mode = xfer->async ? MSPI_ACCESS_ASYNC : MSPI_ACCESS_SYNC;
		break;
	case MSPI_DMA:
#if defined(CONFIG_MSPI_DMA)
	{
		const struct mspi_stm32_conf *cfg = controller->config;

		if (!cfg->dma_specified) {
			LOG_ERR("DMA configuration is missing from the device tree");
			return -EIO;
		}
		access_mode = MSPI_ACCESS_DMA;
		break;
	}
#else
		LOG_ERR("DMA mode not enabled (CONFIG_MSPI_DMA not set)");
		return -ENOTSUP;
#endif
	case MSPI_MEMMAP:
		LOG_ERR("Memory mapped transfers are not supported");
		return -ENOTSUP;
	default:
		LOG_ERR("Invalid transfer mode: %d", xfer->xfer_mode);
		return -EINVAL;
	}

