zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
	/* Acquire the context lock (semaphore) */
	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout)) < 0) {
		return -EBUSY;
	}

	/* Need to map the xfer to the data context */
	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;

	while (ctx->packets_left > 0) {
		packet_idx = ctx->xfer.num_packet - ctx->packets_left;
		packet = &ctx->xfer.packets[packet_idx];

		/*
		 * Always starts with a command,
		 * then payload is given by the xfer->num_packet
		 */
		ret = mspi_stm32_qspi_access(controller, packet, access_mode);

		if (ret != 0) {
			LOG_ERR("QSPI access failed for packet %d: %d", packet_idx, ret);
			ret = -EIO;
			goto out;
		}

		ctx->packets_left--;
	}

out:
	k_sem_give(&ctx->lock);
	return ret;
}

/**
 * @brief QSPI ISR function
 */
static void mspi_stm32_qspi_isr(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	HAL_QSPI_IRQHandler(&dev_data->hmspi.qspi);

	k_sem_give(&dev_data->sync);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);
}

#ifdef CONFIG_PM_DEVICE
/**
 * @brief Power management action callback
 */
static int mspi_stm32_qspi_pm_action(const struct device *dev, enum pm_device_action action)
{
	const struct mspi_stm32_conf *cfg = dev->config;
	struct mspi_stm32_data *dev_data = dev->data;
	int ret;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
		if (ret < 0) {
			LOG_ERR("Cannot apply default pins state (%d)", ret);
			return ret;
		}

		/* Re-enable clock */
		if (clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				     (clock_control_subsys_t)&cfg->pclken[0]) != 0) {
			LOG_ERR("Could not enable MSPI clock on resume");
			return -EIO;
		}

		LOG_DBG("QSPI resumed");
		return 0;

	case PM_DEVICE_ACTION_SUSPEND:
		ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
		if (ret < 0 && ret != -ENOENT) {
			LOG_ERR("Cannot apply sleep pins state (%d)", ret);
			return ret;
		}

		/* Check if XIP is enabled or if controller is in use */
		if (dev_data->memmap_cfg.enable || k_mutex_lock(&dev_data->lock, K_NO_WAIT) != 0) {
			LOG_ERR("Controller in use, cannot be suspended");
			return -EBUSY;
		}

		/* Disable QSPI peripheral */
		if (HAL_QSPI_DeInit(&dev_data->hmspi.qspi) != HAL_OK) {
			LOG_WRN("HAL_QSPI_DeInit failed during suspend");
		}

		/* Disable clock */
		if (clock_control_off(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				      (clock_control_subsys_t)&cfg->pclken[0]) != 0) {
			LOG_WRN("Could not disable MSPI clock on suspend");
		}

		k_mutex_unlock(&dev_data->lock);

		LOG_DBG("QSPI suspended");
		return 0;

	default:
		return -ENOTSUP;
	}
}
#endif /* CONFIG_PM_DEVICE */

/*
 * Driver Initialization
 */
static int mspi_stm32_qspi_init(const struct device *controller)
{
	const struct mspi_stm32_conf *cfg = controller->config;

	LOG_DBG("Initializing QSPI driver");

	/* Initialize QSPI with basic configuration */
	const struct mspi_dt_spec spec = {
		.bus = controller,
		.config = cfg->mspicfg,
	};

	return mspi_stm32_qspi_config(&spec);
}

static DEVICE_API(mspi, mspi_stm32_qspi_driver_api) = {
	.config = mspi_stm32_qspi_config,
	.dev_config = mspi_stm32_qspi_dev_config,
	.memmap_config = mspi_stm32_qspi_memmap_config,
	.get_channel_status = mspi_stm32_qspi_get_channel_status,
	.transceive = mspi_stm32_qspi_transceive,
};

/*
 * DMA Configuration Macros
 */
#if defined(CONFIG_MSPI_DMA)
#define DMA_CHANNEL_CONFIG(node, dir) DT_DMAS_CELL_BY_NAME(node, dir, channel_config)

#define QSPI_DMA_CHANNEL_INIT(node, dir)                                                      \
	.dev = DEVICE_DT_GET(DT_DMAS_CTLR(node)),                                             \
	.channel = DT_DMAS_CELL_BY_NAME(node, dir, channel),                                  \
	.reg = (DMA_TypeDef *)DT_REG_ADDR(DT_PHANDLE_BY_NAME(node, dmas, dir)),               \
	.cfg = {                                                                              \
		.dma_slot = DT_DMAS_CELL_BY_NAME(node, dir, slot),                            \
		.source_data_size =                                                           \
			STM32_DMA_CONFIG_PERIPHERAL_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)), \
		.dest_data_size =                                                             \
			STM32_DMA_CONFIG_MEMORY_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),     \
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(DMA_CHANNEL_CONFIG(node, dir)), \
		.dma_callback = mspi_stm32_qspi_dma_callback,                                 \
	},

#define QSPI_DMA_CHANNEL(node, dir)                                                           \
	.dma = {                                                                              \
		COND_CODE_1(DT_DMAS_HAS_NAME(node, dir),                                      \
			    (QSPI_DMA_CHANNEL_INIT(node, dir)),                               \
			    (NULL))                                                           \
	},
#else
#define QSPI_DMA_CHANNEL(node, dir)
#endif /* CONFIG_MSPI_DMA */

/* MSPI QSPI control config */
#define MSPI_QSPI_CONFIG(index)                                                                \
	{                                                                                      \
		.channel_num = 0,                                                              \
		.op_mode = DT_INST_ENUM_IDX_OR(index, op_mode, MSPI_OP_MODE_CONTROLLER),       \
		.duplex = DT_INST_ENUM_IDX_OR(index, duplex, MSPI_HALF_DUPLEX),                \
		.max_freq = DT_INST_PROP(index, clock_frequency),                              \
		.dqs_support = false, /* QSPI typically doesn't support DQS */                 \
		.num_periph = DT_INST_CHILD_NUM(index),                                        \
		.sw_multi_periph = DT_INST_PROP(index, software_multiperipheral),              \
		.num_ce_gpios = ARRAY_SIZE(ce_gpios##index),                                   \
		.ce_group = ce_gpios##index,                                                   \
	}

