zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_qspi.c
#define STM32_MSPI_QSPI_IRQ_HANDLER(index)                                                     \
	static void mspi_stm32_irq_config_func_##index(void)                                   \
	{                                                                                      \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority),                 \
			    mspi_stm32_qspi_isr, DEVICE_DT_INST_GET(index), 0);                \
		irq_enable(DT_INST_IRQN(index));                                               \
	}

#define MSPI_STM32_QSPI_INIT(index)                                                            \
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);       \
                                                                                               \
	static struct gpio_dt_spec ce_gpios##index[] = MSPI_CE_GPIOS_DT_SPEC_INST_GET(index);  \
                                                                                               \
	PINCTRL_DT_INST_DEFINE(index);                                                         \
                                                                                               \
	STM32_MSPI_QSPI_IRQ_HANDLER(index)                                                     \
                                                                                               \
	PM_DEVICE_DT_INST_DEFINE(index, mspi_stm32_qspi_pm_action);                            \
                                                                                               \
	static const struct mspi_stm32_conf mspi_stm32_qspi_dev_conf_##index = {               \
		.pclken = pclken_##index,                                                      \
		.pclk_len = DT_INST_NUM_CLOCKS(index),                                         \
		.irq_config = mspi_stm32_irq_config_func_##index,                              \
		.mspicfg = MSPI_QSPI_CONFIG(index),                                            \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                 \
		.dma_specified = DT_INST_NODE_HAS_PROP(index, dmas),                           \
	};                                                                                     \
                                                                                               \
	static struct mspi_stm32_data mspi_stm32_qspi_dev_data_##index = {                     \
		.hmspi.qspi = {                                                                \
			.Instance = (QUADSPI_TypeDef *)DT_INST_REG_ADDR(index),                \
			.Init = {                                                              \
				.ClockPrescaler = 0,                                           \
				.FifoThreshold = MSPI_STM32_FIFO_THRESHOLD,                    \
				.SampleShifting = (DT_INST_PROP(index, st_ssht_enable)         \
						  ? QSPI_SAMPLE_SHIFTING_HALFCYCLE             \
						  : QSPI_SAMPLE_SHIFTING_NONE),                \
				.FlashSize = 0x19,                                             \
				.ChipSelectHighTime = QSPI_CS_HIGH_TIME_1_CYCLE,               \
				.ClockMode = QSPI_CLOCK_MODE_0,                                \
				.FlashID = QSPI_FLASH_ID_1,                                    \
				.DualFlash = QSPI_DUALFLASH_DISABLE,                           \
			},                                                                     \
		},                                                                             \
		.memmap_base_addr = DT_INST_REG_ADDR_BY_IDX(index, 1),                         \
		.lock = Z_MUTEX_INITIALIZER(mspi_stm32_qspi_dev_data_##index.lock),            \
		.sync = Z_SEM_INITIALIZER(mspi_stm32_qspi_dev_data_##index.sync, 0, 1),        \
		.dev_cfg = {0},                                                                \
		.memmap_cfg = {0},                                                             \
		.ctx.lock = Z_SEM_INITIALIZER(mspi_stm32_qspi_dev_data_##index.ctx.lock, 0, 1),\
		QSPI_DMA_CHANNEL(DT_DRV_INST(index), tx_rx)                                    \
	};                                                                                     \
                                                                                               \
	DEVICE_DT_INST_DEFINE(index, &mspi_stm32_qspi_init,                                    \
			      PM_DEVICE_DT_INST_GET(index),                                    \
			      &mspi_stm32_qspi_dev_data_##index,                               \
			      &mspi_stm32_qspi_dev_conf_##index, POST_KERNEL,                  \
			      CONFIG_KERNEL_INIT_PRIORITY_DEVICE, &mspi_stm32_qspi_driver_api);

DT_INST_FOREACH_STATUS_OKAY(MSPI_STM32_QSPI_INIT)
